Revit 2026 API

# ThemeType Enumeration

---

The application frame theme Type.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ThemeType
```
```vb
Public Enumeration ThemeType
```
```cpp
public enum class ThemeType
```
```fsharp
type ThemeType
```

| Member name | Value | Description |
| --- | --- | --- |
| CanvasTheme | 0 | CanvasTheme. |
| UITheme | 1 | UITheme. |

#### Reference

Autodesk.Revit.UI Namespace